---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DesignOptionParam
source: html/a06d7729-0296-afdd-4dea-2afe3aad2fa0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DesignOptionParam Property

"Design Option"

## Syntax (C#)
```csharp
public static ForgeTypeId DesignOptionParam { get; }
```